# LevelDataMassFamilyAndTypeParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LevelDataMassFamilyAndTypeParam Property
ParameterTypeId Class See Also
---
"Mass: Family and Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LevelDataMassFamilyAndTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelDataMassFamilyAndTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LevelDataMassFamilyAndTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace